{
    "model_topology":{
        "class_name":"Sequential",
        "config":{
            "name":"sequential_1",
            "layers":[
                {
                    "class_name":"Dense",
                    "config":{
                        "units":16,
                        "activation":"relu",
                        "use_bias":true,
                        "kernel_initializer":{
                            "class_name":"VarianceScaling",
                            "config":{
                                "scale":1,
                                "mode":"fan_avg",
                                "distribution":"normal",
                                "seed":null
                            }
                        },
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{
                                
                            }
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null,
                        "name":"dense_Dense1",
                        "trainable":true,
                        "batch_input_shape":[
                            null,
                            34
                        ],
                        "dtype":"float32"
                    }
                },
                {
                    "class_name":"Dense",
                    "config":{
                        "units":16,
                        "activation":"relu",
                        "use_bias":true,
                        "kernel_initializer":{
                            "class_name":"VarianceScaling",
                            "config":{
                                "scale":1,
                                "mode":"fan_avg",
                                "distribution":"normal",
                                "seed":null
                            }
                        },
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{
                                
                            }
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null,
                        "name":"dense_Dense2",
                        "trainable":true
                    }
                },
                {
                    "class_name":"Dense",
                    "config":{
                        "units":1,
                        "activation":"sigmoid",
                        "use_bias":true,
                        "kernel_initializer":{
                            "class_name":"VarianceScaling",
                            "config":{
                                "scale":1,
                                "mode":"fan_avg",
                                "distribution":"normal",
                                "seed":null
                            }
                        },
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{
                                
                            }
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null,
                        "name":"dense_Dense3",
                        "trainable":true
                    }
                }
            ]
        },
        "keras_version":"tfjs-layers 3.6.0",
        "backend":"tensor_flow.js"
    },
    "model_metadata":{
        "format":"layers-model",
        "generatedBy":"TensorFlow.js tfjs-layers v3.6.0",
        "convertedBy":null
    },
    "info":{
        "dateSaved":"2021-05-03T04:06:13.172Z",
        "modelTopologyType":"JSON",
        "modelTopologyBytes":1468,
        "weightSpecsBytes":374,
        "weightDataBytes":3396
    },
    "weight_specs":[
        {
            "name":"dense_Dense1/kernel",
            "shape":[
                34,
                16
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense1/bias",
            "shape":[
                16
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense2/kernel",
            "shape":[
                16,
                16
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense2/bias",
            "shape":[
                16
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense3/kernel",
            "shape":[
                16,
                1
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense3/bias",
            "shape":[
                1
            ],
            "dtype":"float32"
        }
    ],
    "weight_data":"e9nHvfUt0D6h7gQ9fW+4PsFHQT7cQ429QBNIPtMUtb4mh9g9Yg46vOnTMr4g4Qi9hOFAvrCgDT3llNK99ayYPB3SaD+GjYC/RZ+IPnWCwbwgGWc/oH0Ov6rXDD8iKj2/+gqfvSa0A79oUci92CozvpxVkb4HIwY9tunYvVtgAT26OHq+tFRjPZUSGz4kfla92hkiPbCirr4zgBA+Qy3fPYVcuT1X6/m+iItYvTFqc748aZU9kjLyPP9L+z3vV/c9m60/P1qWTr/tw5U9W9zyPrMcXT+/DPC+D+AGP24Crr4DE4E972YqvxvMe75IoSk8HzekvglGkT6ctDe++NDYPeEw9TzCAfM+JqmxvppvZb65sZg+DRAmPtz9Wr3V3Bs+B/1WPkl5Jz0SR+E9I0c7vmTVgDxqLoI92kP3vcRdmL4Aelo/5sYUv/wZ8r2aKwk+81JfP9eaAr8tBbo+ylufvvmsKD1PCDO/UlOLPf0nfr0PFFk9tdxuOkEjyD2kxyA+s2q6PSAx5b7GIAU+p5e1PG4cPDx9sk+9or4DvjGHxL6B1V2+Vq15vmZtNb6DjmY+M+uhPZgYPD0+E5k9Dnx5Pmx8lD5gQxW/tDqZvgSsbT5HKjk/rp09PhZYXT56Rji+EC2CPZesBr/yAuo96qOHvsV7YL5Tapi+L1KqPWXUJL4Bco2+hl3pPQFZBT5f2hY+if4bPzslv7z90o++vo1GvCKWiT3qQHq9CTaivaAcdz34N4m+WG12vcV43zsWPQA9yD/VPpaLj74FbSa9TSAtPm4+qD5oHbW+KD1XPkUcsr4dzri90toDv9etYT6Q108+DSKHPm1DOD7fG3A8y8K6PDzwFb9VVS8/ZbRcvWN1ET4oIDq/G6QfvnTHiL5hwoe7UPwLPqk1Qzuqir68FPUVPvgUIL6iUGI+BJqdPnBslD609ga+yHnKPjCOUj5nqKO9sXDNvPTpDL2ExZU9s3Oivqw8Sr7eDKu+a/ymvH3AhT5vMUW+lL6RvnSiND6DS7Q+g+3LPkNOqD0MRDS+R2mDPsPqIz/A0Gw+BOtQvncssz6e5Zq+1F1KPqnRu74JZxW+Yqu3PnYGzD7gkNo72a/OvjjlOb/TM9I+WQA8Pp1Hjz2bnI2+hAMnviWdxb67qAS/9wEgPllg2r7TQhY9ns0ivqGNfb0WdVe+fjz8Pb2+pD5IiCc+l8UvvaaDzz07Zbs+j6eFvi7iq7uf0DU+TGcRPt+yI768hgS+2ZcNPpunJ70A2wi+y6ooveAFqL2JHPQ9M0n7PpQGkb7FB06+FdQnvqZ1Kr5NfI+9Xt98Pg8XJD1lqLo9Ltravke1OT5Z8KS76wHqPaYNij7d3Ss9HVdJvP4GoT19ioO+HgiWPhyEmb6+LqE+0eFFPkk8aj79VTQ+NT9DPuLHzj67wAC+380hvoftkz5KTcE9meM1PPObgD5xSBq/razLPrWs4D0e25q9yDLfvWbXwr0hSdC+c+1mPY5FOj5MhZ++QdqavsZdhb5aKRi+wSRMvRH0Qr6sdyc+IFVlP4UcWb8ZbwU+W04BPsN3wz0/uIw+IEnYPuMDQz6knpS+e6edPlZxPb7BLZ6+nAIjPuqL4D4jxVC+atoZPhiaj7+Ck6o/8P7iPV8AX77B60S/vhAIP79aL79Vnyk/DDHdPrpboT8adko+y7YUva5ntz0t62c8x18mvujB/L3T2a0+9duavmIaWL6FhWm9eDKUvk84Pz4gg4k+3jkXPcC9tD0x5hU/0mfNPFAxcz3fwOw8W2lpPuP9bb7E+b6+zhiHv2gtmz/kbts9nz1vu6WCHr+VSBU/W44Gv5dPIj9T8x4+ETh8P15iIL3Owak9KLFRvbN0OD5aRKq92Rt4vp008T7oRZa8dfSHPa5rxz3xiOW+By3sPFCWlz5Pi1k+3yK3vXPKBz5nqB4+fQ2dPhB+b74InyI8L86KPCQTAb3vNUk/w3wLv4sYLD3nfoS+SffEPCOBgL1IsSE+5zyHPd2/z75g7wI+3kUKve1Sgr4KnKy9Z/XKPacTYb59Ngg9xTamvGmJbD711ym9WfHSvXa6sD5Ani0+nCoYPvGJKr1oP2A+ug2+Pq8GiT3LrGS9uf4nPmkkWr0M2wM+za65PYyYiz/C+/O+172QvuIJkz5PteU+8voKPgo9Ez/pJGs9QRlzvkv0mD1I1Si+MjkCvonDSD0TEg891fGOvXLdAL2fWY2+IihIPv3Sh7vFjKO9TydJvuq9yj3kCKs9Z/DOPUfRkr3EVNM7aKU3vnu/eL5hXym+2NbgvvZ2pj6/WBG9hFGDPCBSY74wVcW+HX7QPW+W+judkie8e6hZvZjlFr6bEVo+RaoHPx20cj4Qz3i+UGccPZyM5jl+OwU+oDiUPSlBbb7WG5M92wYNvC8jvL7ooUg+weaavdPnRb2nooq9Dx8ovtNs/L1rdrC9GO0mPniERr59qYe90qPyvV+cCT4XNjQ+Ta0vPh8u0j1uA4K6CjiLPpV4T76GgMM9eomrPs/3dT4KnJk+zuWfvHBYBD6pbFc+8CbVPTIiU74WOXu9V5aqPgodtL6Ikfa84SBvu1UFCz8/Qfg9G0NhvhEOpD6PqUe+QDjPPoe6lLzOkEw+JtLSvdI7Xb4izby8A5o0PoED1z6ueKG+IM8Lve8zWbyGBHO6smMYvcEmwT4CDfm+hACNvR1DQL4NSAC+kMW4Pixo37t33L++7KF2vVD+Nr6BaYg+5GODPgntEzwrtXq+jerOvALTkD6y/rC8hkelPh4A7z2MjNc+SySvPgsze73e5y88Va+Fvi/leL0YpjG+FbbwPksCkb45YUS+/mQLvA9WnT0fVvE7n2evPrZAOD45x9o9K5qlvjEHoL27SIE9HixsveXyl77Vn+O951BBvim3v76Ap88+aWm+PFcShr0msCi/00pavjn1aL7I8Yq+ypvFPTYFzr795s288Va1vAAAAAB2nly9IF8UvC9nLDwdvQU+C1Mrv5SOXT+MUCW+cqCIvrVdgz4Vylu+9NnhvshAqD7U7Qy+tL44O15hfj8zKig+x4sZvsDstj5rE8+974ztPCvsXD5vI9++8nYXPj8Yhz6DtZe+mghCP9Mdcr374SG+CfR2vtpqIz4draO+nNa1vUxMA71eQpW8A39fPzoQLL69Nvy+yUG0vWCN3LvV7Ty+Z5KUvHYMlj7MZdE+Hc7NPXsVOr5yA1w9RYemvUwgoT6aXBI+Px2tvk/DXr7dKkM+nrtcPsBLkz5niWG93ShoPjVkAj5hzQq+cvPNvgZ1Wb4z1tK+D9eCPpep6br/2Wo+0OqNPuos4r702M09x76Cvjop0L2vr5Q/dOmBvmXxtb4LEBQ+a+ADv+svir40idy9vI8XvixIvT2LqVk/IyE7PjCYUb1EzMk+cejsvtZuNb533ry+j0sFv/EUdDx4bio+9ZJyPmOFhjsUyeO90vfgvowPXT4QKnQ+xJ71vmzwJz5nAa++vCbKPvo2pT71owi+6BQHvrqUxD58GsA+mkyJvh5C4j6V2Jg9wI5lvhJ9oD4+rxI+D1U5vrVnzz4V074+D9OAvn77Nr41Sry9vC2qPWTKuL6FBgK/uc7kPUrrl75yfE07GpahPZWV1z5cSlW8m1VRvu2Tgj3wR0C/yQmuvluLXb5n26O90ZHgPlGgbb6mElo+wSyNvZWPHT7GYK09mbYkPkH+Yj4GbiC6uzyyvorKh75CVig+LJitPS7BZr7xboO9Xt6+vkY/iD5D9IG+6qO8vvwRXr+omLM8SPMlvUwiab4/748+vACzvUMeJL7s7zW+S565PfgyZb9OCge+NxxRPuTS2z62/Io/M/nCPnxkWj5nXQC9+8g4PsRenb1cWJi8KrhxvopOhL5COaK+b/TtPHw1N74Pz+S+sFSUvqA4o77iYas+VN6jvkBSab4HAUM9FhcrvCMNhD6Vnrk+31xpviWdeT5/BUm9/fSbPteQ6D6S9s09CNDSPQ58QL59/yE+oBkWvq5GaT2RhMK+qNzWPqMJ6b16e7S+/muAPTFCvbydgne+UpsNPnQ/2r7X01e+YrgIvpUJvL5EmvW+p2JbPrvtsj1sv9G9ptG3PrN0Yb2w0QI/Hqk5PSLcCz7wcaC+ixQ7vlBoSz3KUtw9nouMvoFBk76BFWM+jSmPPqP2XT5Jmxu8ufXZvhoq/77gd/w6m/Gpvszjtr6UTU8+Lcz9PdXeZz3gSkA+6Uv8vvyAIL5eBMc+qdcZPhAJmL7RdDw+XlQcvPhnW77P0yq+Ir7ZPljBtj5Hq3U+LWGWvYDJfD1VI8Y9hnRZPiknmz2mGgC+8lUXPY3Ipb0CPxE9RvxcvgYtrb4R54g+gxtjPYBE6T4GwmC9bAZnPU/FEz6JZ529tKaNPvyWsjv0o6s9AAAAAIffqT1yo4E9+B8YOgAAAADuxYm8KrGSPo13sr5GynE/05njv2O9iz65dDI/PntfvsrcTT/hZwq/fomWvqyapT6iqZE+DR/Pv8hdy76UlwY/nP/wPiOWuz+xkw8/"
}