{
    "model_topology":{
        "class_name":"Sequential",
        "config":{
            "name":"sequential_2",
            "layers":[
                {
                    "class_name":"Dense",
                    "config":{
                        "units":16,
                        "activation":"relu",
                        "use_bias":true,
                        "kernel_initializer":{
                            "class_name":"VarianceScaling",
                            "config":{
                                "scale":1,
                                "mode":"fan_avg",
                                "distribution":"normal",
                                "seed":null
                            }
                        },
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{
                                
                            }
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null,
                        "name":"dense_Dense4",
                        "trainable":true,
                        "batch_input_shape":[
                            null,
                            34
                        ],
                        "dtype":"float32"
                    }
                },
                {
                    "class_name":"Dense",
                    "config":{
                        "units":16,
                        "activation":"relu",
                        "use_bias":true,
                        "kernel_initializer":{
                            "class_name":"VarianceScaling",
                            "config":{
                                "scale":1,
                                "mode":"fan_avg",
                                "distribution":"normal",
                                "seed":null
                            }
                        },
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{
                                
                            }
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null,
                        "name":"dense_Dense5",
                        "trainable":true
                    }
                },
                {
                    "class_name":"Dense",
                    "config":{
                        "units":1,
                        "activation":"sigmoid",
                        "use_bias":true,
                        "kernel_initializer":{
                            "class_name":"VarianceScaling",
                            "config":{
                                "scale":1,
                                "mode":"fan_avg",
                                "distribution":"normal",
                                "seed":null
                            }
                        },
                        "bias_initializer":{
                            "class_name":"Zeros",
                            "config":{
                                
                            }
                        },
                        "kernel_regularizer":null,
                        "bias_regularizer":null,
                        "activity_regularizer":null,
                        "kernel_constraint":null,
                        "bias_constraint":null,
                        "name":"dense_Dense6",
                        "trainable":true
                    }
                }
            ]
        },
        "keras_version":"tfjs-layers 3.4.0",
        "backend":"tensor_flow.js"
    },
    "model_metadata":{
        "format":"layers-model",
        "generatedBy":"TensorFlow.js tfjs-layers v3.4.0",
        "convertedBy":null
    },
    "info":{
        "dateSaved":"2021-04-16T12:15:17.646Z",
        "modelTopologyType":"JSON",
        "modelTopologyBytes":1468,
        "weightSpecsBytes":374,
        "weightDataBytes":3396
    },
    "weight_specs":[
        {
            "name":"dense_Dense4/kernel",
            "shape":[
                34,
                16
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense4/bias",
            "shape":[
                16
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense5/kernel",
            "shape":[
                16,
                16
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense5/bias",
            "shape":[
                16
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense6/kernel",
            "shape":[
                16,
                1
            ],
            "dtype":"float32"
        },
        {
            "name":"dense_Dense6/bias",
            "shape":[
                1
            ],
            "dtype":"float32"
        }
    ],
    "weight_data":"mJ6bPQZwUD6+jQY+iyCqPKqwwL54b3C+aVfhu4ZKTD0WKDK9GHtVviVOJz1jR1M+S0uZPdP2uT2MuIq+8pfpvkcAXr6sSDk/+YGLPj7wRb/E3cU9JL+Qvnk+gb5Dqhm/pl0KPPAc+L1cdVe9jJXyPDXfrD3bQtS9uDisv1leMT+PUYg+3JyTPg90Ib5krTa+lGnpvHjMAz4qKak9j6zyPddOe73NEhI8MwaOvddyhb6tl5Q9xgJJvcGFvb7xOvK+bKW1PluQCj9Cqp8+dHshvydGub5yU+69T7w1PsQrOb/EfVc9CKQkviZaRT3UYw28ejqEPiVC9z1HU4G/pTqMP7d3oz5byzG+YKowvmqFTL1ALQe+o80PvUAANz6DfpU+V2hIvrheCj4NSNW7Y+obO5GD471Z6AW+EpO5vKn8Eb/bsGG+fqdLP7HFBz6+DRW/iuusvdy1I77D2qc+hnI9v6KXXj66qbQ+6zaKvsbuhD6LthA9wkdIPoYjgb/JEGc/UNSLvuJ5ij6pdYg+kR7hPDP+iD0oSP675ttuveKMwb3fmWC+PvJbPopHVj7lVIA+Lc30PWr9Kb6VFbq7Jzw5vhObiT4+DPc+yW47vnkq+r60QAk+S0WFvURGFT7c8MW90SZZPqzKUD6LROQ+80Q6PGIj0jx7ohS+k98Uv+YuHj9lHuE+A907PhfU8z5q2xW8Kx/5O870jbx1ZoW+U2RBvsGCyL7TmoK+i0w+vtmExD2eu9S8/6+8PuSKzDn+ZAW//wJZPdrfHz+sMKg+AB2evq2LRL4JPDy9EqLCu34xkb5RweS9k4MVPiX+Pj7XX7++6tREPgCHMr6mFTm/DQYQP/OL571fUF6+z7+DvTuJ/D7rmFE9j69WvjCtXz0R/ng+E+J1vJJBPD58594+//3IO7IIS73kJro8Yc95vtNnjb66RQE+oFeGvvjJBL4Vvde8lr05Pi7ebb60s28+GwD5PTDcsTzZ1TM+ArwoP37cYb7YT9g9A8nVvRqDQL+tPwE+PXKrPc++GT+jOwQ+8ZRSvViXKr5l+AU+iF1Jvo6zj77JFLq+U9ADPa3jFL83pZM+oYPWPWmWa739lwc+QkA0PrkYIL6vwoO+5yF8vtxZFD0RRCk+rHqXvmmes752cLA+Wiq0PQh5n76jw4c/jXgfPWmvUz73qWe+zjXmvjuIzjwIzBY9gzEkPko11r4MVXI9eNc2vgBDkj1HrYa+hGGZvWSqC74cfpi+nd4HvnnBdz7vdrC+PrClPo6m5j0St7S74rgcvu3R+D1p2MQ98YBvvhFFMj42IwS+a4lvvqJkDL7bKyI+CM6mvs7tqb7nZk+7DDkCvqEhTj42mXG9G/sZPtp/hD4GxlI+qCEHPiYMqb0W/g0+qcipPv1bGbr3TDO95N+sPaYBoD6Ahou+cpgRvj/3yj4BpRE+YtadPr+TOL86s+i9DjMOu2CYeD3TGfU++/kQvSpZrb1QR5g9Kn9JPtgbu75h7e29WB8NPwGw+L52wR6+0/wEPglq177bK82+OIOcvlImCD6Q3hS+i5gDv/8RJz6xt2a+audLPkfb0b0i/bk96skMvjXEEb+prbs+WLTLvRheYL61rmM+gnpMPijjdz5Zp4G/uoWovR4+oD87B8091qqFPdJhDb5uDIs/Bt4wvoMHaj5Fdtu9ZU7mvvM0zT4n0gK+AxXGP10yur9WtWG+LAC5PuOGCL6Dkgk+CIftvQwGjr5kenS+FaBvvp/rFz7lBhq9e33zvZ+Lij6ZLWy+xemhPp8B1T6eMay+C8CMvcRvv77WJyw+8Q9kP8Arp77tXx2+TcuGPqdOhT9elzm+T0fEPHfZlL0175W+fvwkvZXzfD0mS8A/C86kv3PbhT1EDrQ+aSM5vhT8fr69mpY95nnpPN5Otr43w6q6d934vMj55rtvgBC7vSGrvhjo9r0i+EC93r2tPYYaAD8wsrK9rLkMPsIsbD46m1s81mKQPjW1Rb6rJOs98zbovVTyrr1g4A8+A0revglimj7rmVU+nMr8PSPhpT4Ae1w/IQSJPbRMqr25HCA+8/7avavAgL7AQp6+8tKiPlT7Er7Xjoi8IHH2vdVPdb16RJW+E2CRPvWnCr53BPU9lkZYvgROBz5/vN0+gkjhvF7JP7/kkh6+KrU0vXRwQD34AEO/4XapPvoF0L3JDZG/doDdPnuxgT3zs2i+eNedPYcx9D4qP889vnMRvkAtn76oc5y9rUAXPPztBb6D6Sq+4ZNnPUM5GL6Guug9aGgFPj2esr66dUs+Q8c3vsUBsD6/oVY+NvyZPDkq+D3ijR++Y30HvjGMurzDLYC+t1ARPrzBDz1EvBQ+0TIuvFPRsb6ENLo+iFmZvJ6cNb4l4dw+VgmePr0Xaz3dQmC8S7+QPvgf0b1GTbU9eeGMvuSx8L1tbEm+/Fh8Pku2ZD1fyAE8QvsBvg4iDL1YSFI+jHaNvaJw3r0Qgg0+ZdcGPUcqIr59C2k9eGRMvdP2Tz6sh/Q9ItCuPa3rlj0SqeW9kRdfvvH8yz5nnNe7Y13QvPTK8D1J90w8uJcaPt/Zw7yYN0S+pJguPkN18r2ppye9XUaXPrFbZb4dsAa9HTCrPrhlz76JsP6+lcZ4vr0E6L1l7vc+sl75PoYDuL5a3ZM+IkhsPcAyWL6lSK09N1NuvlHYBL6UC46+Vic9vOhGET5eSC29/9jau6hjK70hVS89ApwGv0HJ7D4BIrW+5MItvv1qkz4BYng+psG8vv2T2j1Foly+a36/PqzHBb3AkDS+S/mavvbRxr6RZWE+OTNgPq5joD7r2po8smqlvN3WwzzsbDY+ZY7lPbB8L7wD8Ma94LHMPTtEJL7wp1C9ruNbvhynWLkXL4g+WlGhveE1XL6VPsO9inkKP/k+zb27dyC+tyJivtb7oj5Qu3O8AAAAACoBbDzPlJ4+FSnyuzAUaLi4zzU/zYTEvfgXCbyfPxe9Ko30vmFwhb3m3km9fuLIPUUZEzz8sQ6+JqmjPhSEiz2rJ9I+nwWiPmQyt74Z5vi+d/qFvqOK9r3k8g0+g5ixvuo63r53rNy93WWFPlowRj4EwOA+7G/BPdZQMT+CO6Y+lb/wPW36fD84Oxw+7CDlvBzxtr7/yBC+doqrPkzn8brNU5E8ydErPlrNJL4CV6881EeyvKJIfj1uf4E+frLoPJkr67xEYIQ+qfPOPaeTIb8NbZS+C8+nvbgH9D06OyQ8Kmw2vuXBlD5cQ+g+Nu4CvjmrrL4qHJK+7kQYv6DjoT6YRqc9Nc9fvrY1fT6QxdI+EeeUPdQ7a7zKs8Y+ejVrPtJcLT1AqAa+tbWhPtQfZbwxuZM+G9kKvd5f7r3bZ/6+3fagPu5QwL6fd2S+REhAPoLXR74f5V09Lju6Pl49KD6ewPK+mGLCvKW4Jz6hloM+XTmmPnAaGT0uo/s8txOnPjdkrz1jx7O9NkWFPhP1xr51K7Y+j4XIvs9RBL6TRbi+jDV8PpSxqD6WmLo+w0XPPbIoQb3hu069o4ZiPojpK74csqG+EP4sPuc/4b29F7I9G2GzvWMk0L0VQtQ7TboavRF5Vb37dcK8sMqSPlbNsL4Y/Jg7lxWGPUaVJb+WoWi9hUuUO/FJ/b0SsLW9vPUfPwQDRz76Izq+J1umvt9QZT69AAg+imW4vsmIjr0VXBA+UlqbvgWwVz3y6ia9S90UPqbG1L2vx0Q+i803vX1A0j1DDbI+wefsPT4IGL3qUjc+QxqIPgPOP75mM34+gfveu65Tir4p3ci+uAKzPsed2r3CC46+od9fvh2AgT0P276+CMSnPtmwvbyc+cM9HXanvHe1iT1nu1g+fo7kPpzHJb6/RR6+ej5evumX9r5qEn4+ZU0/P+9Wgr+sQoi+MfmvP2Wujr6qtbw9alRzvWl04T6TCAI+w62vvrXf8r1K9++9Mb1KO1+/aT1Jifk+Iu/hPVfrS76IFxY/dtupPgjzGL8RvRM+Rh3OvTq1bz7S2MC9AcXzvdBd175yNsK+ctU6PXCTrTxMOfo+ny+qPuVorz4sSqe9MH2Gvo4lQT671Zk+mMCyPqtqa71qJLy+D9KEPr0mnT4vxAs/28ONPb75Br55TT4+qQ9/voE/q70Ht5e+1NaZPsdlAj+k7I6+c4jePqStubwnkYm+AERmPXJUpL6YiEI+3bYwvru2Dj4cuvC9rQO3vTPunb5EtLq+l0BwvjFkCT9AroW/J5vbvnMcQz8qGt++o9Q+PjGMLr47ZXI/obUCvaMrwr4ayKi+WNexPbBjlD7HZxI+RiAFP9Lz0T1jfJe+gepaP+6kNj9CcSm/ebxUPM3sqL0zHyS+4acKvz5dyz1CVA8/IsbyO2zCST2Z8bO9XlYsPZWZqTyKwLi896UDPewzgT6Epem7PFZmPsvDm7yQinI6rwniuyr1Cz6z66W8biXzPbHzCz8tRiW+AbEBv7luGr+TCqW/VLv+PFreXD98x+i/7W5Qv0e27D+QCnA+QoOWvrAfBb691I0/DhyQPXOXPb88iuo9"
}